# a = ""
# b = ''
# c = ''''''
# d = "Hello Python qwllww"
# print(type(d))

# print(len(d))

# # print('ll' in d)
# res = d.find('ll')
# res2 = d.find('ll', res+1)
# res3 = d.find('ll', res+1, 8)
# print(res, res2, res3)

# ------
# " Max ".strip() # убирает пробелы по краям
# "".lstrip()
# ''.rstrip()

# name = input("Name")
# name = input("Name").lower()
# name = "Max"

# # name = name.upper() # в верхний регистр
# # name = name.lower() # в нижний регистр

# print("max" in name)
# print("max" in name.lower())

# print(print(1))

# ------------------

# a = "Hello  python!!!"
   
# # b = a.replace("  ", " ")
# # b = b.replace("!!!", "!")
# # print(b)

# a = a.replace("  ", " ").replace("!!!", "!")
# print(a)

# -------------------------------------
# СРЕЗЫ
# a = "0123456789"

# b = a[4]
# b = a[0:4]
# b = a[:4]
# b = a[4:len(a)]
# b = a[4:]
# b = a[:]
# b = a[-5]
# b = a[-4:-2]
# b = a[1:8:2]
# b = a[::-1]
# b = a[-2:-5:-1]
# b = a[2:-4]
# b = a[-4:2:-1]
# b = a[9:1]

# print(b)
# # a[от:до:шаг]
# ---------------------------------



# name = "Vasya"
# age = 22

# template = "Привет я {} мне {} года"

# print("Привет я %s мне %d года" % (name, age))
# print(template.format(name, age))
# print("Привет я {name1} мне {age1} года".format(name1=name, age1=age))
# print("Привет я {1} мне {0} года".format(age, name))

# print(f"Привет я {name} мне {age} года")
# print(f"Привет я {name:*^15} мне {age} года")
# print(f"Привет я {name:*<15} мне {age} года")
# print(f"Привет я {name:*>15} мне {age} года")

# # b = 12_345_678
# b = 12345678

# print(b)

# print(f"Сумма: {b:,}")
# print(f"Сумма: {b:_}")
# print(f"Сумма - {112.12992876:.2f}")

# # как я и говорил 2 формата нельзя, но это оказывается один формат с разными опциями
# print(f"Сумма - {121212112.12992876:_.2f}") # -> 121_212_112.13

# # можно так же писать скобки внутри
# a = 'hello 1'
# print(f"{a:*{['<','^','>'][len(a)%3]}{len(a*10)}}") # догадайтесь что тут происходит

# print(f"Сумма - {323123:010}") # дополнят нулями до 10 знаков

# print("{}:{:02}:{:02}".format(12, 1, 2)) # время
# print(f"{12}:{1:02}:{2:02}") # время

# print(format(1, "02"))
# print(format("123", "*>15"))

# -----------------------------------------

# a = "Hello python"


# print('123'.isdigit())
# print("abc123!".isalnum())
# print("abc1".isalpha())

# print("abac1a".count("a"))


# print('qqq www  eee rrr'.split())
# print('qqq www eee rrr'.split(" ", 2))
# print('1,2,3,4,5'.split(','))

# a = '1,2,3,4,5'.split(',')
# b = list(map(int, a))
# print(b)
# print(sum(b))
# print(min(b))
# print(max(b))

# a = list(map(len, 'qqqqq ww  eee rrr'.split()))

# print(a)
# print(sum(a))

# str.count("ababab", "a")
# # "a".count()
# map(str.lower, ['AAAA', "BBB"])

# a, b, c = '1 2 3'.split()
# a, b, c = 1, 2, 3, 4

# a = [1, 2, 3] # список
# -----------------------------------------------



# множественная замена подстрок
# a = "Однажды, в студеную зимнюю пору"
# b = a.maketrans({"а":"А","у":"У","и":"И"})
# b = a.translate(b)
# print(b)

# -------------------------------
# a = b"Helo"
# a = "Helo Пайтон 👍".encode('utf-8')
# b = a.decode('utf-8')

# print(a)
# print(b)

# # --------------------
# print(ord('A'))
# print(chr(65))
# print(ord("♌"))


# # repr() -  возвращает строку, содержащую печатное представление объекта.
# # Для строк repr() добавляет кавычки и экранирует специальные символы.
# # Для чисел возвращает просто строковое представление числа.
# print(repr('Hello'))
# print('-------')

# #asci() Возвращает читаемую версию объекта, экранируя символы, отличные от ASCII
# print(ascii("hello пайтон 👍"))
# # Если в строке есть символы, не входящие в стандартную 
# #       ASCII-таблицу (например, кириллица, эмодзи и т.д.), 
# #       они заменяются на escape-коды вида \x, \u или \U.
# # Для ASCII-символов (например, латиница, цифры, основные 
# #       знаки препинания) строка возвращается как есть.


# # выводим строку, которая содержит Unicode-escape последовательности.
# print("\u043f\u0430\u0439\u0442\u043e\u043d \U0001f44d")

# r'''
# \uXXXX - обозначает Unicode-символ с 16-битным кодом (4 hex-цифры)
# \UXXXXXXXX - обозначает Unicode-символ с 32-битным кодом (8 hex-цифр)
# Unicode — это стандарт кодирования символов, который включает 
# в себя символы почти из всех письменных языков мира, а также 
# множество специальных символов

# Чтобы преобразовать строку Unicode в байты, 
# используется метод encode() с указанием кодировки (например, 'utf-8').

# Чтобы преобразовать байты в строку Unicode, 
# используется метод decode().

# '''


# # ------------------------------------------





# # ------

# # import builtins
# # pr = builtins.print
# # p = print
# # print = 1
# # p(print)













