# Это комментарий

# IDLE - редактор с интерпретатором устанавливается вместе с python
#           там можно писать и запускать код если нет IDE (vscode и пр.)           

# PATH - (путь) системная переменная где хранятся пути к важным программам

# открыть консоль - win+r - ввести cmd

''' 
многострочный комментарий

команды консоли
    cd folder - перейти в папку
    cd .. - перейти в предыдущую папку
    dir - посмотреть содержимое папки
    md folder - создать новую папку
'''



print(1)
print(2+2*2)
print('-'*30)
print("Hello Python")