# операторы  + - * / // % = и др.

print(15 / 5)
print(15 / 7)
print(15 // 7)
print(15 % 4)
print(2 + 2*2)
print((2 + 2)*2)
print((2+2)*2*2 + 457/(2+457))

a:int = 0

a = 1
a = "1"
b = 2
print(a + a)
print(b + b)
print(a*50)
print(type(a), type(b))
# print(a + a*b + b + 100)
print(a+a, b+b, "hello")

WEIGHT = 60 #константа - переменная которая не меняет значение

# user_name - snake case
# userName - camel case

user2 = 1
#2user = 1 # нельзя

s = "1234" # str
s = 'Hello'
s = ''
s = ' '
 
age = 12 # int
a = 1.5 # float
a = 2 + 2*2 #int
a = 10/5 # float - любое деление дает float

ok = True # bool
ok = False

c = None # отдельный тип данных - только одно значение


user = "Вася" + " " + "3" # конкатенация
name = "Петя"

user = user + "3" # так можно
# user = user + 3   # так нельзя - к тексту нельзя прибавить число

user_age = 12

print(user, user_age, WEIGHT) # это функция print

# ---------------------------------

print(type(s), len(s))
print(type(age))
print("bd", 2025 - age)

a = type(ok)
print(a)
# ----------------------------
a = 1
b = "qqq"
print(isinstance(a, int))
print(isinstance(b, int))
print(isinstance(b, str))
# ----------------------------------

age = "55"
age = int(age)
print(2025 - age)
print("age:" + str(age))

age = "55"
print(2025 - int(age))

# перевод типов
#str()
#int()
#float()
#bool()

a = 1
b = "2"
c = "2.2"


print(a + int(b))
print(a + float(c))
print(str(a) + b)
print(int(2.9), round(2.421254, 2))
print('---------bool---------')
print(bool(0), bool(1), bool(11), bool(-5), bool(5-5))
print(bool(""), bool("d"), bool("строка"))


# --------------------------------
# print(1+1)
# print(1-1)
# print(1/1)
# print(1*1)
# print(1**1) # степень
# print(14/2) # 
# print(15/2) # 
# print(15//2) # целая часть
# print(15%2) # остаток

# int(2 + 2*2) # существует приоритет операций 
# подробно про приоритет в презентации -  последняя страница
# print((2 + 2) * 2)

# -----------------------
# a = 10
# a = a + 1
# a += 1 # тоже самое - увеличили а на 1
# a += 100 # тоже самое - увеличили а на 100

# a += 1 # a = a + 1
# a -= 1 # a = a - 1
# a /= 1
# a *= 1

# --------------------------------
# a = b = c = 10
# a, b, c = 10, 16, "hello"
# print('----', a, b, c)

# a, b = b, a
# print('----', a, b, c)


# --------------------------------
a = "python"
b = 'hello'

print(a + b)
print(a + " - " + b)
print(a, "-",  b)
print("-"*20, a, b)
print(a * 10)

print("тут " + a + " какой-то " + b + " текст")
print("тут {a} какой-то {b} текст")
print(f"тут {a} какой-то {b} текст")

print("hello \npython")
print("путь к папке с:\new_folder")
print(r"путь к папке с:\new_folder")
print("путь к папке с:\\new_folder")
print("путь к \"папке\" ")
print('путь к "папке" ')

# -----------------------------------
a, b, c, d = 1, 2, 3, 4

print(a, b, c, d)
print(a, b, c, d, sep="---")
print(a, b, c, d, sep="")
print(a, b, c, d, sep="\n")

print(a, b, c, d, end=" -/- ")
print(a, b, c, d)
print(a, b, c, d, end="--\n--", sep='_-_')
print(a, b, c, d, sep='_-_', end="--\n--")
print(a, end="--\n--")
print()
# ---------------------------

# a = 111 ** 1111

# print(a, a.__sizeof__(), sep='\n')

# a = 1_234_567_323_323 # для удобства
# print(a)

a = 1.12121 + 1.32323 + 55.4234234234
print(round(a, 4))
print(a)

import math
print(dir(math))
# math.floor(2.5) # округляет вниз
# math.ceil() # округляет вверх

# --------------------------
a = 1
b = 1
# b = 2
print(id(a), id(b))
print(a is b)
b = 2
print(a is b)
print(a, b)

# ----------------------------------

# --------------------------------
a = "очень длинная строка очень длинная строка очень длинная строка " + \
    "очень длинная строка очень длинная строка очень длинная строка "
print(a)    

a = "очень длинная строка очень длинная строка очень длинная строка " \
    "очень длинная строка очень длинная строка очень длинная строка "
print(a)    

a = ("очень длинная строка очень длинная строка очень длинная строка " 
     "очень длинная строка очень длинная строка очень длинная строка ")
print(a)   

a = """
очень длинная строка очень длинная строка очень длинная строка
очень длинная строка очень длинная строка очень длинная строка 
очень длинная строка очень длинная строка очень длинная строка
очень длинная строка очень длинная строка очень длинная строка
очень длинная строка очень длинная строка очень длинная строка
очень длинная строка очень длинная строка очень длинная строка
"""
       
print(a)

# ---------------------------------------------

# --------------------------------
# ctrl+c - остановить программу в любой момент

name = input("Как твое имя: ") # возвращает всегда строчный/текстовый  тип данных
print("Привет", name)
age = int(input("Возраст: "))
print(age, type(age))
year = 2025 - age
print(f"Привет {name} тебе {age} лет. \n" \
      f"Ты родился в {year} году.")

