"""
Дан произвольный список. Вывести на экран в обратном порядке.
Задачу решить 2мя способами.
"""

c = [1, 2, 99, 55, 5, 6, 7, 8]

print(c[::-1])
c.reverse()
print(c)
