# # списки

# a = list()
# a = []
# print(a, type(a))

# b = [1, 2, 3, 4, 10]
# c = [1, 2, 99, 55, "hello", True, None]
# print(b)

# print(len(c)) # длина списка

# e = b + c # сложение
# print(e) 
# print(c*3) # умножение


# # --- срезы ---------------------------------------------
# print(b[2])
# print(b[2:4])
# print(c[::-1])
# print(c[-1])

# c[2] = 88
# print(c)



# # --- map join ---------------------------------------------
# a = ["1", "2", "3"] 
# print("---".join(a)) # работает только если в списке все элементы str
# print("\n".join(a))
# print("".join(a))

# l = ['1', '22', '333']
# print(list(map(len, l)))

# # --- поиск элементов ---------------------------------------------
# print("1" in l)
# print("1" not in l)
# print("1" in l)


# # --- вложенность ------------------------------------------
# l = [1, 2, 3, [4, 5, [1, 2, "hello", ['python', [1, 2], 2, 66, ]], 6, 7], 7, 9]
# print(len(l))
# print(l[3][2])
# print(l[3][2][3])
# print(l[3][2][3][1])
# print(l[3][2][3][1][0])

# user = ["vasya", 22, "vasya123", '1234', ['12345', '37129837']]

# users = [
#     ["vasya1", 22, "vasya123", '1234', ['12345', '37129837']],
#     ["vasya2", 22, "vasya123", '1234', ['12345', '37129837']],
#     ["vasya3", 22, "vasya123", '1234', ['12345', '37129837']],
#     ["vasya4", 22, "vasya123", '1234', ['12345', '37129837']],
#     ["vasya5", 22, "vasya123", '1234', ['12345', '37129837']],
# ]

# print(users)
# print(users[2][4])

# # from pprint import pprint
# # pprint(users)

# print(*users, sep='\n')

# # a = [1, 2, 3]
# # print(*a)
# # print(1, 2, 3)

# print(*map(len, '123456'))

# # --- матрица -------------------

# a = [[1, 2, 3],
#      [4, 5, 6],
#      [7, 8, 9]]

# print(a[2][2])

# # --- zip ---------------------

# a = [1, 2, 3]
# b = [4, 5, 6]

# c = list(zip(a, b))

# print(c)

# # --- преобразование в список ---------------------------    

# a = list("hello")
# print(a)

# a = map(len, ['1', '22', '333'])
# print(a)
# print(list(a))

# # --- методы списков -----------------------

# a = []

# a.append(1) # добавить элемент - добавляет в конец
# a.append(2)
# a.append(5)
# print(a)

# # a.clear() # очистить

# b = a.copy() # поверхностная копия

# a.count(1) # сколько в списке элементов со значением 1

# b = [7, 8, 9] # расширение списка
# a.extend(b) # меняется оригинал
# # a = a + b
# print(a)

# print(a.index(7)) # поиск элемента и возврат его индекса
# a.insert(0, 99)
# print(a)

# print(a.pop()) # удалить и вернуть последний
# print(a.pop(2)) # удалить и вернуть по индексу
# b = a.pop(1)
# print(a)


# a.remove(99) # удалить по значению 
# print(a)

# a.reverse() # перевернуть список - меняет оригинал
# a[::-1]     # аналогично, но не меняет оригинал

# a = [4, 5, 99, 0, 2] 
# a.sort() # сортировка
# print(a)
# b = sorted(a)

# глобальный универсальный оператор del
# del a[2:4] 
# del a[-1]
# del a[2]

# -----------------------------
# поведение изменяемых типов данных
# изменяемые типы:
    # list (список)
    # dict (словарь)
    # set (множество) 
    
a = [1, 2, 3, 4, 5, [9, 10]]
b = a # a и b это одно и тоже - один и тот же объект
print(a is b)
b.append(6)
b.append(7)
print(a is b)
print(id(a), id(b))

print(a)
print(b) # добавилось в оба списка, т.к. это одно и тоже

print('----------------------')
b = a.copy() # создаст поверхностную копию
# c = list(a) # аналогично
# c = a[:] # аналогично
print(a is b) # False - теперь это разные объекты

b.append(7)
b[5].append(99) # добавится и "b" и в "а" т.к. как это вложенный список
                # поверхностные копии не затрагивают вложенные списки
print(a)
print(b)

print('----------------------')
import copy
b = copy.deepcopy(a) # глубокая копия - создает новый объект 
                     # на всех уровнях вложенности
b.append(7)
b[5].append(99)
print(a)
print(b)

# print(a[99])





